In [1]:
list1 = [1,2,3,4,5]
list1

[1, 2, 3, 4, 5]

In [2]:
list1[2]

3

In [5]:
import pandas as pd

series1 = pd.Series(list1, index= ['a', 'b', 'c', 'd', 'e'])

In [7]:
series1['e']

5

In [10]:
rollnos =[10,20,30,40]

rollnos_series = pd.Series(rollnos, index =['rahul', 'arun', 'kumar', 'sagar'])

In [11]:
rollnos_series['sagar']

40

In [12]:
some_dict = {'a':1, 'b':2, 'c':3}

In [14]:
some_dict

{'a': 1, 'b': 2, 'c': 3}

In [15]:
pd.Series(some_dict)

a    1
b    2
c    3
dtype: int64

In [18]:
rollnos_series.max()

40

In [ ]:
def factorial(num1):

In [19]:
def print_welcome():
    print("i have been called, welcome to teh function definiition ")

In [20]:
print_welcome()

i have been called, welcome to teh function definiition

In [22]:
list_marks_updated =[]
for num in list_marks:
    num_updated = grace_marks(num)
    list_marks_updated.append(num_updated)

In [23]:
list_marks_updated

[60, 71, 60, 38, 27, 82, 93]

In [21]:
def grace_marks(marks):
    return marks+5


list_marks =[55,66,55,33,22,77,88]
series_marks = pd.Series(list_marks)
series_marks.apply(grace_marks)

0    60
1    71
2    60
3    38
4    27
5    82
6    93
dtype: int64

In [24]:
list_marks =[55,66,55,None,22,77,88]

series_marks = pd.Series(list_marks)

series_marks.isna()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [27]:
#series_marks.fillna(0, inplace=True)

series_marks = series_marks.fillna(0)

In [28]:
series_marks

0    55.0
1    66.0
2    55.0
3     0.0
4    22.0
5    77.0
6    88.0
dtype: float64

In [29]:
list_names= ['arun', 'kumar', 'rahul']
list_marks =[55,66,77]
combined_list = list(zip(list_names, list_marks))

In [30]:
combined_list

[('arun', 55), ('kumar', 66), ('rahul', 77)]

In [33]:
students_df = pd.DataFrame(combined_list, columns=['Name', 'Marks'] )

In [35]:
students_df.set_index('Name')

       Marks
Name
arun      55
kumar     66
rahul     77

In [4]:
import pandas as pd  

dict_stds = {'taran':77,'arun':66, 'yasir':55}

In [5]:
dict_stds={'names':['taran', 'arun', 'yasir'], 'marks': [77,66,55]}

In [6]:
dict_stds

{'names': ['taran', 'arun', 'yasir'], 'marks': [77, 66, 55]}

In [7]:
stds_df = pd.DataFrame(dict_stds)

In [8]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [48]:
std_list = [{'taran':77}, {'arun':66}, {'yasir':55}]

In [50]:
std_list =[{'names':'taran', 'marks':77},]

In [51]:
pd.DataFrame(std_list)

   names  marks
0  taran     77

In [53]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [54]:
stds_df.set_index('names')

       marks
names
taran     77
arun      66
yasir     55

In [56]:
stds_df['marks']

0    77
1    66
2    55
Name: marks, dtype: int64

In [58]:
import numpy as np
arr_2d = np.random.randint(2,9,(4,2))

In [60]:
pd.DataFrame(arr_2d,  columns=['A', 'B'])

   A  B
0  8  3
1  3  8
2  8  2
3  6  7

In [64]:
stds_df[(stds_df['marks']>66) | (stds_df['names']=='taran')]

   names  marks
0  taran     77

In [71]:
stds_df = stds_df.rename(columns={'names':'Names', 'marks': 'Marks'})

In [74]:
stds_df

   Names  Marks
0  taran     77
1   arun     66
2  yasir     55

In [73]:
#stds_df.drop(columns ='Names')
stds_df.drop('Names', axis =1)

   Marks
0     77
1     66
2     55

In [10]:
import pandas as pd

titanic_df = pd.read_csv("C:\\Users\\HP\\Downloads\\titanic (1).csv")
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
titanic_df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [8]:
titanic_df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [9]:
titanic_df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [10]:
titanic_df[titanic_df['Sex']=='male'][['Name','Age']]

                               Name   Age
0           Braund, Mr. Owen Harris  22.0
4          Allen, Mr. William Henry  35.0
5                  Moran, Mr. James   NaN
6           McCarthy, Mr. Timothy J  54.0
7    Palsson, Master. Gosta Leonard   2.0
..                              ...   ...
883   Banfield, Mr. Frederick James  28.0
884          Sutehall, Mr. Henry Jr  25.0
886           Montvila, Rev. Juozas  27.0
889           Behr, Mr. Karl Howell  26.0
890             Dooley, Mr. Patrick  32.0

[577 rows x 2 columns]

In [15]:
titanic_df['Survived'].unique()

array([0, 1])

In [14]:
print("the no. of male passengers survived who are above 20 is",titanic_df[(titanic_df['Sex']=='male') & (titanic_df['Survived']==1) & (titanic_df['Age']>20)].shape[0])

the no. of male passengers survived who are above 20 is 64

In [13]:
titanic_df.shape

(891, 12)

In [11]:
titanic_df[(titanic_df['Sex']=='male') & (titanic_df['Survived']==1) & (titanic_df['Age']>20)][['Name','Age']].to_csv('males_survived.csv')

In [12]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
titanic_df.set_index('PassengerId', inplace=True)

In [18]:
titanic_df.iloc[:,:]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [1]:
titanic_df.loc[0:10, ['Name','Age']]

NameError: name 'titanic_df' is not defined

In [20]:
grouped_data = titanic_df.groupby('Sex')

In [21]:
grouped_data.get_group('male').shape

(577, 11)

In [22]:
titanic_df[titanic_df['Sex']=='male'].shape

(577, 11)

In [19]:
titanic_df.groupby(['Survived','Sex'])['PassengerId'].agg(['sum','mean'])

                    sum        mean
Survived Sex
0        female   35223  434.851852
         male    210189  449.121795
1        female  100120  429.699571
         male     51854  475.724771

In [23]:



a=titanic_df.groupby(['Survived','Sex'])['PassengerId'].agg(['sum'])
df3 = a.groupby(level=0).apply(lambda x:100 * x / float(x.sum()))
df3

C:\Users\HP\AppData\Local\Temp\ipykernel_13068\1835839242.py:2: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  df3 = a.groupby(level=0).apply(lambda x:100 * x / float(x.sum()))

                                sum
Survived Survived Sex
0        0        female  14.352599
                  male    85.647401
1        1        female  65.879690
                  male    34.120310

In [17]:
titanic_df.pivot_table(index='Age',columns='Embarked',values='Fare',aggfunc='sum')

Embarked        C     Q        S
Age
0.42       8.5167   NaN      NaN
0.67          NaN   NaN   14.500
0.75      38.5166   NaN      NaN
0.83          NaN   NaN   47.750
0.92          NaN   NaN  151.550
...           ...   ...      ...
70.00         NaN   NaN   81.500
70.50         NaN  7.75      NaN
71.00     84.1584   NaN      NaN
74.00         NaN   NaN    7.775
80.00         NaN   NaN   30.000

[88 rows x 3 columns]